import "./styles.css";
import { motion, useScroll } from "framer-motion";
import { Card } from 'antd';


export function LoremIpsum() {
    return (
      <>
        <article>
          <p style={{textAlign:'center'}}>
          <strong> Дәулетова Елизаттың </strong> "Қазақ тіліндегі қолжазба мәтінді тануға арналған бағдарламалық қосымшаны әзірлеу" дипломдық жұмысы компьютерлік лингвистика саласындағы өзекті және қызықты жұмыс болып табылады.
          </p>
          <h3 style={{textAlign:'center'}}>Толық ашатын болсақ</h3>
          <p>


<strong>Дипломдық жұмыс аясында </strong>  қазақ тіліндегі қолжазба мәтінді тануға мүмкіндік беретін бағдарламалық қосымша әзірленді. Осы мақсатқа жету үшін жеделхат боты, компьютер қосымшасы және сайт құрылды.

Телеграм-бот пайдаланушыларға қазақ тілінде қолжазба мәтіні бар суреттерді жүктеуге және жауап ретінде танылған мәтінді алуға мүмкіндік береді. Компьютер қосымшасы бірдей функционалдылықты қамтамасыз етеді, бірақ файлдарды әртүрлі форматта жүктеу мүмкіндігі бар. Сонымен, сайт суреттерді жүктеуге және тану нәтижелерін алуға мүмкіндік береді.

Жұмыс барысында қолжазба мәтінін тану үшін компьютерлік көру және машиналық оқытудың әртүрлі әдістері қолданылды. Модельдерді оқыту үшін қазақ тілінде деректерді жинау және дайындау бойынша ауқымды жұмыс жүргізілді.

<strong>Дәулетова Елизаттың </strong> дипломдық жұмысы қазақ тіліндегі компьютерлік лингвистиканың дамуына маңызды үлес болып табылады және оны автоматты аударма жүйелері, сөйлеуді тану жүйелері және т.б. сияқты түрлі қосымшаларда қолдануға болады.
          </p>
       
  
          <p>
          <strong> <em>"Жұмыстың басты нәтижелерінің бірі білім беру, ғылыми зерттеулер, іскерлік және жеке мақсаттар сияқты түрлі салаларда қолдануға болатын қазақ тіліндегі қолжазба мәтінді тануға арналған бағдарламалық қосымшаны жасау болып табылады."</em> </strong> 


          </p>
          <p>Сондай-ақ, жұмыс аясында қазақ тіліндегі қолжазба мәтінді танудың әртүрлі әдістерін салыстыру жүргізілді, бұл осы саладағы болашақ зерттеулер үшін пайдалы болуы мүмкін.</p>

          <p>


Жұмыс сонымен қатар бағдарламалық жасақтама мен компьютерлік лингвистикамен айналысатын студенттер үшін оқу материалы ретінде пайдалануға болатын қызықты жоба болып табылады.

Жалпы, Дәулетова Елизаттың дипломдық жұмысы қазақ тіліндегі компьютерлік лингвистика саласындағы маңызды жұмыс болып табылады және осы саладағы одан әрі зерттеулер үшін негіз ретінде пайдаланылуы мүмкін.
          </p>

    

        </article>
      </>
    );
  }
  

export default function Main() {
  const { scrollYProgress } = useScroll();

  return (
    <>

      <motion.div
        className="progress-bar"
        style={{ scaleX: scrollYProgress }}
    />
     
     <div style={{padding:10}}>
      <Card title={ <h1 style={{textAlign:'center'}}>
      <h2> Қазақ тіліндегі қолжазба мәтінді тануға арналған бағдарламалық қосымшаны әзірлеу</h2>
      </h1>} 
      style={{padding:10}} 
      >
      <LoremIpsum />
      </Card>
      </div>

    </>
  );
}
